<!DOCTYPE HTML><html lang=""><head><meta charset="UTF-8"><meta content="text/html; charset=utf-8" http-equiv="Content-Type"><title>Design Patterns · Java Summarize</title><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="description" content=""><meta name="generator" content="GitBook 3.2.3"><meta name="author" content="Jayclang"><link rel="stylesheet" href="../../gitbook/style.css"><link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css"><link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css"><link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css"><meta name="HandheldFriendly" content="true"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><meta name="apple-mobile-web-app-capable" content="yes"><meta name="apple-mobile-web-app-status-bar-style" content="black"><link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png"><link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon"></head><body><div class="book"><div class="book-summary"><div id="book-search-input" role="search"><input type="text" placeholder="Type to search"></div><nav role="navigation"><ul class="summary"><li><a href="http://www.metoocat.cn" target="_blank" class="custom-link">liangwj's Blog</a></li><li class="divider"></li><li class="chapter" data-level="1.1" data-path="../../"><a href="../../">Introduction</a></li><li class="chapter" data-level="1.2"><span>Notes</span><ul class="articles"><li class="chapter" data-level="1.2.1"><span>Algorithms</span><ul class="articles"><li class="chapter" data-level="1.2.1.1" data-path="../algorithms/Big-Data.html"><a href="../algorithms/Big-Data.html">Big Data</a></li><li class="chapter" data-level="1.2.1.2" data-path="../algorithms/DataStructures-Algorithms.html"><a href="../algorithms/DataStructures-Algorithms.html">Data Structures Algorithms</a></li></ul></li><li class="chapter" data-level="1.2.2"><span>Database</span><ul class="articles"><li class="chapter" data-level="1.2.2.1" data-path="../database/DataBaseDesign.html"><a href="../database/DataBaseDesign.html">Data Base Design</a></li><li class="chapter" data-level="1.2.2.2" data-path="../database/MySQL.html"><a href="../database/MySQL.html">My SQL</a></li><li class="chapter" data-level="1.2.2.3" data-path="../database/Redis.html"><a href="../database/Redis.html">Redis</a></li></ul></li><li class="chapter" data-level="1.2.3"><span>Design</span><ul class="articles"><li class="chapter active" data-level="1.2.3.1" data-path="Design-Patterns.html"><a href="Design-Patterns.html">Design Patterns</a></li></ul></li><li class="chapter" data-level="1.2.4"><span>Framework</span><ul class="articles"><li class="chapter" data-level="1.2.4.1" data-path="../framework/Dubbo.html"><a href="../framework/Dubbo.html">Dubbo</a></li><li class="chapter" data-level="1.2.4.2" data-path="../framework/Kafka.html"><a href="../framework/Kafka.html">Kafka</a></li><li class="chapter" data-level="1.2.4.3" data-path="../framework/MyBatis.html"><a href="../framework/MyBatis.html">My Batis</a></li><li class="chapter" data-level="1.2.4.4" data-path="../framework/netty.html"><a href="../framework/netty.html">Netty</a></li><li class="chapter" data-level="1.2.4.5" data-path="../framework/Nginx.html"><a href="../framework/Nginx.html">Nginx</a></li><li class="chapter" data-level="1.2.4.6" data-path="../framework/Solr.html"><a href="../framework/Solr.html">Solr</a></li><li class="chapter" data-level="1.2.4.7" data-path="../framework/Spring.html"><a href="../framework/Spring.html">Spring</a></li><li class="chapter" data-level="1.2.4.8" data-path="../framework/Tomcat.html"><a href="../framework/Tomcat.html">Tomcat</a></li><li class="chapter" data-level="1.2.4.9" data-path="../framework/Zookeeper.html"><a href="../framework/Zookeeper.html">Zookeeper</a></li></ul></li><li class="chapter" data-level="1.2.5"><span>Java</span><ul class="articles"><li class="chapter" data-level="1.2.5.1" data-path="../java/Java基础.html"><a href="../java/Java基础.html">Java基础</a></li><li class="chapter" data-level="1.2.5.2" data-path="../java/Java容器.html"><a href="../java/Java容器.html">Java容器</a></li><li class="chapter" data-level="1.2.5.3" data-path="../java/Java并发.html"><a href="../java/Java并发.html">Java并发</a></li><li class="chapter" data-level="1.2.5.4" data-path="../java/Java虚拟机.html"><a href="../java/Java虚拟机.html">Java虚拟机</a></li></ul></li><li class="chapter" data-level="1.2.6"><span>Network</span><ul class="articles"><li class="chapter" data-level="1.2.6.1" data-path="../network/Computer-Network.html"><a href="../network/Computer-Network.html">Computer Network</a></li></ul></li><li class="chapter" data-level="1.2.7"><span>Os</span><ul class="articles"><li class="chapter" data-level="1.2.7.1" data-path="../os/Linux.html"><a href="../os/Linux.html">Linux</a></li><li class="chapter" data-level="1.2.7.2" data-path="../os/Operating-System.html"><a href="../os/Operating-System.html">Operating System</a></li></ul></li><li class="chapter" data-level="1.2.8"><span>Scene</span><ul class="articles"><li class="chapter" data-level="1.2.8.1" data-path="../scene/Scene-Design.html"><a href="../scene/Scene-Design.html">Scene Design</a></li></ul></li></ul></li><li class="divider"></li><li><a href="https://www.gitbook.com" target="blank" class="gitbook-link">Published with GitBook</a></li></ul></nav></div><div class="book-body"><div class="body-inner"><div class="book-header" role="navigation"><h1><i class="fa fa-circle-o-notch fa-spin"></i> <a href="../..">Design Patterns</a></h1></div><div class="page-wrapper" tabindex="-1" role="main"><div class="page-inner"><div id="book-search-results"><div class="search-noresults"><section class="normal markdown-section"><p><strong>Table of Contents</strong> <em>generated with <a href="https://github.com/thlorenz/doctoc" target="_blank">DocToc</a></em></p><ul><li><a href="#23%E7%A7%8D%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F%E5%BD%A9%E5%9B%BE">23&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5F69;&#x56FE;</a><ul><li><a href="#%E5%8A%A8%E6%80%81%E4%BB%A3%E7%90%86%E5%92%8C%E9%9D%99%E6%80%81%E4%BB%A3%E7%90%86">&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C;&#x9759;&#x6001;&#x4EE3;&#x7406;</a></li><li><a href="#%E9%9D%99%E6%80%81%E4%BB%A3%E7%90%86">&#x9759;&#x6001;&#x4EE3;&#x7406;</a></li><li><a href="#%E5%8A%A8%E6%80%81%E4%BB%A3%E7%90%86">&#x52A8;&#x6001;&#x4EE3;&#x7406;</a></li><li><a href="#%E9%9D%99%E6%80%81%E4%BB%A3%E7%90%86%E4%B8%8E%E5%8A%A8%E6%80%81%E4%BB%A3%E7%90%86%E7%9A%84%E5%8C%BA%E5%88%AB">&#x9759;&#x6001;&#x4EE3;&#x7406;&#x4E0E;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x533A;&#x522B;</a></li></ul></li><li><a href="#jdk%E4%B8%AD%E7%9A%84%E5%8A%A8%E6%80%81%E4%BB%A3%E7%90%86%E5%92%8Ccglib">JDK&#x4E2D;&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C;CGLIB</a></li><li><a href="#%E5%AE%9E%E7%8E%B0%E5%8A%A8%E6%80%81%E4%BB%A3%E7%90%86%E7%9A%84%E6%96%B9%E6%A1%88%E6%9C%89%E4%B8%8B%E5%88%97%E5%87%A0%E7%A7%8D">&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6848;&#x6709;&#x4E0B;&#x5217;&#x51E0;&#x79CD;</a></li></ul><p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E3B;&#x8981;&#x5206;&#x4E09;&#x4E2A;&#x7C7B;&#x578B;:&#x521B;&#x5EFA;&#x578B;&#x3001;&#x7ED3;&#x6784;&#x578B;&#x548C;&#x884C;&#x4E3A;&#x578B;&#x3002;</p><p><strong>&#x521B;&#x5EFA;&#x578B;</strong></p><ol><li>Singleton&#xFF0C;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#xFF1A;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x7C7B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x5B83;&#x7684;&#x5168;&#x5C40;&#x8BBF;&#x95EE;&#x70B9;</li><li>Abstract Factory&#xFF0C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x5173;&#x6216;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x65E0;&#x987B;&#x6307;&#x5B9A;&#x5B83;&#x4EEC;&#x7684;&#x5177;&#x4F53;&#x7C7B;&#x3002;</li><li>Factory Method&#xFF0C;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8BA9;&#x5B50;&#x7C7B;&#x51B3;&#x5B9A;&#x5B9E;&#x4F8B;&#x5316;&#x54EA;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;Factory Method&#x4F7F;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x5EF6;&#x8FDF;&#x5230;&#x4E86;&#x5B50;&#x7C7B;&#x3002;</li><li>Builder&#xFF0C;&#x5EFA;&#x9020;&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x5EFA;&#x4E0E;&#x4ED6;&#x7684;&#x8868;&#x793A;&#x76F8;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x5F97;&#x540C;&#x6837;&#x7684;&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x793A;&#x3002;</li><li>Prototype&#xFF0C;&#x539F;&#x578B;&#x6A21;&#x5F0F;&#xFF1A;&#x7528;&#x539F;&#x578B;&#x5B9E;&#x4F8B;&#x6307;&#x5B9A;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x62F7;&#x8D1D;&#x8FD9;&#x4E9B;&#x539F;&#x578B;&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li></ol><p><strong>&#x884C;&#x4E3A;&#x578B;</strong></p><ol><li>Iterator&#xFF0C;&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x5BF9;&#x8C61;&#x7684;&#x5404;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x53C8;&#x4E0D;&#x9700;&#x8981;&#x66B4;&#x9732;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x3002;</li><li>Observer&#xFF0C;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#xFF1A;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x95F4;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x4E8E;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x5F97;&#x5230;&#x901A;&#x77E5;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x3002;</li><li>Template Method&#xFF0C;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E2D;&#x7684;&#x7B97;&#x6CD5;&#x7684;&#x9AA8;&#x67B6;&#xFF0C;&#x800C;&#x5C06;&#x4E00;&#x4E9B;&#x6B65;&#x9AA4;&#x5EF6;&#x8FDF;&#x5230;&#x5B50;&#x7C7B;&#x4E2D;&#xFF0C;TemplateMethod&#x4F7F;&#x5F97;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x4E0D;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x7ED3;&#x6784;&#x5373;&#x53EF;&#x4EE5;&#x91CD;&#x5B9A;&#x4E49;&#x8BE5;&#x7B97;&#x6CD5;&#x5F97;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x6B65;&#x9AA4;&#x3002;</li><li>Command&#xFF0C;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x5C01;&#x88C5;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x5BF9;&#x5BA2;&#x6237;&#x8FDB;&#x884C;&#x53C2;&#x6570;&#x5316;&#xFF0C;&#x5BF9;&#x8BF7;&#x6C42;&#x6392;&#x961F;&#x548C;&#x8BB0;&#x5F55;&#x8BF7;&#x6C42;&#x65E5;&#x5FD7;&#xFF0C;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x53EF;&#x64A4;&#x9500;&#x7684;&#x64CD;&#x4F5C;&#x3002;</li><li>State&#xFF0C;&#x72B6;&#x6001;&#x6A21;&#x5F0F;&#xFF1A;&#x5141;&#x8BB8;&#x5BF9;&#x8C61;&#x5728;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x6539;&#x53D8;&#x65F6;&#x6539;&#x53D8;&#x4ED6;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x5BF9;&#x8C61;&#x770B;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x6539;&#x53D8;&#x4E86;&#x4ED6;&#x7684;&#x7C7B;&#x3002;</li><li>Strategy&#xFF0C;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#xFF1A;&#x5B9A;&#x4E49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x628A;&#x4ED6;&#x4EEC;&#x4E00;&#x4E2A;&#x4E2A;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x4F7F;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x66FF;&#x6362;&#xFF0C;&#x672C;&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4E8E;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x5BA2;&#x6237;&#x3002;</li><li>China of Responsibility&#xFF0C;&#x804C;&#x8D23;&#x94FE;&#x6A21;&#x5F0F;&#xFF1A;&#x4F7F;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x8BF7;&#x6C42;&#x7684;&#x9001;&#x53D1;&#x8005;&#x548C;&#x63A5;&#x6536;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x5173;&#x7CFB;</li><li>Mediator&#xFF0C;&#x4E2D;&#x4ECB;&#x8005;&#x6A21;&#x5F0F;&#xFF1A;&#x7528;&#x4E00;&#x4E2A;&#x4E2D;&#x4ECB;&#x5BF9;&#x8C61;&#x5C01;&#x88C5;&#x4E00;&#x4E9B;&#x5217;&#x7684;&#x5BF9;&#x8C61;&#x4EA4;&#x4E92;&#x3002;</li><li>Visitor&#xFF0C;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#xFF1A;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#x4E8E;&#x67D0;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x5404;&#x5143;&#x7D20;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x5404;&#x5143;&#x7D20;&#x7C7B;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B9A;&#x4E49;&#x4F5C;&#x7528;&#x4E8E;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x65B0;&#x64CD;&#x4F5C;&#x3002;</li><li>Interpreter&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#xFF0C;&#x5B9A;&#x4E49;&#x4ED6;&#x7684;&#x6587;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x8FD9;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x4F7F;&#x7528;&#x8BE5;&#x8868;&#x793A;&#x6765;&#x89E3;&#x91CA;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x53E5;&#x5B50;</li><li>Memento&#xFF0C;&#x5907;&#x5FD8;&#x5F55;&#x6A21;&#x5F0F;&#xFF1A;&#x5728;&#x4E0D;&#x7834;&#x574F;&#x5BF9;&#x8C61;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6355;&#x83B7;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5728;&#x8BE5;&#x5BF9;&#x8C61;&#x4E4B;&#x5916;&#x4FDD;&#x5B58;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x3002;</li></ol><p><strong>&#x7ED3;&#x6784;&#x578B;</strong></p><ol><li>Composite&#xFF0C;&#x7EC4;&#x5408;&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x5BF9;&#x8C61;&#x7EC4;&#x5408;&#x6210;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x4EE5;&#x8868;&#x793A;&#x90E8;&#x5206;&#x6574;&#x4F53;&#x7684;&#x5173;&#x7CFB;&#xFF0C;Composite&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x5BF9;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x548C;&#x7EC4;&#x5408;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x4E00;&#x81F4;&#x6027;&#x3002;</li><li>Facade&#xFF0C;&#x5916;&#x89C2;&#x6A21;&#x5F0F;&#xFF1A;&#x4E3A;&#x5B50;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x7EC4;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x754C;&#x9762;&#xFF0C;fa?ade&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x9AD8;&#x5C42;&#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x4F7F;&#x5F97;&#x5B50;&#x7CFB;&#x7EDF;&#x66F4;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x3002;</li><li>Proxy&#xFF0C;&#x4EE3;&#x7406;&#x6A21;&#x5F0F;&#xFF1A;&#x4E3A;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x4EE3;&#x7406;&#x4EE5;&#x63A7;&#x5236;&#x5BF9;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x8BBF;&#x95EE;</li><li>Adapter,&#x9002;&#x914D;&#x5668;&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x4E00;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x8F6C;&#x6362;&#x6210;&#x5BA2;&#x6237;&#x5E0C;&#x671B;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;Adapter&#x6A21;&#x5F0F;&#x4F7F;&#x5F97;&#x539F;&#x672C;&#x7531;&#x4E8E;&#x63A5;&#x53E3;&#x4E0D;&#x517C;&#x5BB9;&#x800C;&#x4E0D;&#x80FD;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x90A3;&#x4E9B;&#x7C7B;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;</li><li>Decrator&#xFF0C;&#x88C5;&#x9970;&#x6A21;&#x5F0F;&#xFF1A;&#x52A8;&#x6001;&#x5730;&#x7ED9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x5C31;&#x589E;&#x52A0;&#x7684;&#x529F;&#x80FD;&#x6765;&#x8BF4;&#xFF0C;Decorator&#x6A21;&#x5F0F;&#x76F8;&#x6BD4;&#x751F;&#x6210;&#x5B50;&#x7C7B;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3002;</li><li>Bridge&#xFF0C;&#x6865;&#x6A21;&#x5F0F;&#xFF1A;&#x5C06;&#x62BD;&#x8C61;&#x90E8;&#x5206;&#x4E0E;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x90E8;&#x5206;&#x76F8;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x7684;&#x53D8;&#x5316;&#x3002;</li><li>Flyweight&#xFF0C;&#x4EAB;&#x5143;&#x6A21;&#x5F0F;</li></ol><h2 id="23&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5F69;&#x56FE;">23&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5F69;&#x56FE;</h2><p><img src="https://github.com/zaiyunduan123/Java-Interview/blob/master/image/design-1.jpg" alt=""></p><h1 id="&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C;&#x9759;&#x6001;&#x4EE3;&#x7406;">&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C;&#x9759;&#x6001;&#x4EE3;&#x7406;</h1><h3 id="&#x9759;&#x6001;&#x4EE3;&#x7406;">&#x9759;&#x6001;&#x4EE3;&#x7406;</h3><p>&#x8FD9;&#x79CD;&#x4EE3;&#x7406;&#x65B9;&#x5F0F;&#x9700;&#x8981;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x548C;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x4E00;&#x6837;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x524D;&#xFF0C;&#x4EE3;&#x7406;&#x7C7B;&#x7684;.class&#x6587;&#x4EF6;&#x5C31;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x3002;</p><p>&#x4F18;&#x70B9;&#xFF1A;</p><ol><li>&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x6269;&#x5C55;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x529F;&#x80FD;&#x3002;</li></ol><p>&#x7F3A;&#x70B9;&#xFF1A;</p><ol><li>&#x5197;&#x4F59;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x8981;&#x624B;&#x52A8;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x7C7B;&#x7F16;&#x5199;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x7406;&#x7C7B;&#x3002; &#x4E3A;&#x73B0;&#x6709;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#x90FD;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x7406;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x8BA9;&#x5B83;&#x5B9E;&#x73B0;&#x548C;&#x76EE;&#x6807;&#x7C7B;&#x76F8;&#x540C;&#x7684;&#x63A5;&#x53E3;</li><li>&#x4E0D;&#x6613;&#x7EF4;&#x62A4;&#x3002;&#x4E00;&#x65E6;&#x63A5;&#x53E3;&#x589E;&#x52A0;&#x65B9;&#x6CD5;&#xFF0C;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x4E0E;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x90FD;&#x8981;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x9759;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x7F3A;&#x9677;</li></ol><h3 id="&#x52A8;&#x6001;&#x4EE3;&#x7406;">&#x52A8;&#x6001;&#x4EE3;&#x7406;</h3><p>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x5229;&#x7528;&#x4E86;JDK API&#xFF0C;&#x8FD0;&#x7528;&#x53CD;&#x5C04;&#x673A;&#x5236;&#x52A8;&#x6001;&#x5730;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x6784;&#x5EFA;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x5BF9;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7406;&#x529F;&#x80FD;&#x3002;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;JDK&#x4EE3;&#x7406;&#x6216;&#x63A5;&#x53E3;&#x4EE3;&#x7406;&#x3002;</p><p>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x662F;&#x5B9E;&#x73B0;JDK&#x91CC;&#x7684;InvocationHandler&#x63A5;&#x53E3;&#x7684;invoke&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4EE3;&#x7406;&#x7684;&#x662F;&#x63A5;&#x53E3;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x4E1A;&#x52A1;&#x7C7B;&#x5FC5;&#x987B;&#x8981;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#xFF0C;&#x901A;&#x8FC7;Proxy&#x91CC;&#x7684;newProxyInstance&#x5F97;&#x5230;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;</p><p>&#x4F18;&#x70B9;&#xFF1A;</p><ol><li>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x5BF9;&#x8C61;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6C42;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x3002;</li></ol><h3 id="&#x9759;&#x6001;&#x4EE3;&#x7406;&#x4E0E;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x533A;&#x522B;">&#x9759;&#x6001;&#x4EE3;&#x7406;&#x4E0E;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x533A;&#x522B;</h3><ol><li>&#x9759;&#x6001;&#x4EE3;&#x7406;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x5C31;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#xFF0C;&#x7F16;&#x8BD1;&#x5B8C;&#x6210;&#x540E;&#x4EE3;&#x7406;&#x7C7B;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;class&#x6587;&#x4EF6;</li><li>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x5373;&#x7F16;&#x8BD1;&#x5B8C;&#x6210;&#x540E;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x7684;class&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7C7B;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x5E76;&#x52A0;&#x8F7D;&#x5230;JVM&#x4E2D;</li><li>&#x9759;&#x6001;&#x4EE3;&#x7406;&#x901A;&#x5E38;&#x53EA;&#x4EE3;&#x7406;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x662F;&#x4EE3;&#x7406;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x4E0B;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x73B0;&#x7C7B;&#x3002;</li><li>&#x9759;&#x6001;&#x4EE3;&#x7406;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x8981;&#x4EE3;&#x7406;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x4EE3;&#x7406;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x77E5;&#x9053;&#x3002;</li></ol><h2 id="jdk&#x4E2D;&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C;cglib">JDK&#x4E2D;&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x548C;CGLIB</h2><p><strong>&#x52A8;&#x6001;&#x4EE3;&#x7406;</strong></p><ol><li><p>JDK&#x4E2D;&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#xFF1A; &#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x7C7B;Proxy&#x4EE5;&#x53CA;InvocationHandler&#x56DE;&#x8C03;&#x63A5;&#x53E3;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;</p></li><li><p>&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7F3A;&#x70B9;&#xFF1A; JDK&#x4E2D;&#x6240;&#x8981;&#x8FDB;&#x884C;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x7C7B;&#x5FC5;&#x987B;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EA;&#x80FD;&#x5BF9;&#x8BE5;&#x7C7B;&#x6240;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4EE3;&#x7406;&#xFF0C;&#x8FD9;&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x4E2D;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x53CD;&#x5C04;&#x7684;&#x6548;&#x7387;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x9AD8;&#x3002;</p></li></ol><p><strong>CGLIB</strong></p><ol><li><p>CGLIB&#x539F;&#x7406;&#xFF1A;&#x52A8;&#x6001;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x8981;&#x4EE3;&#x7406;&#x7C7B;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x5B50;&#x7C7B;&#x91CD;&#x5199;&#x8981;&#x4EE3;&#x7406;&#x7684;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x4E0D;&#x662F;final&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#x91C7;&#x7528;&#x65B9;&#x6CD5;&#x62E6;&#x622A;&#x7684;&#x6280;&#x672F;&#x62E6;&#x622A;&#x6240;&#x6709;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x987A;&#x52BF;&#x7EC7;&#x5165;&#x6A2A;&#x5207;&#x903B;&#x8F91;&#x3002;&#x5B83;&#x6BD4;&#x4F7F;&#x7528;java&#x53CD;&#x5C04;&#x7684;JDK&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x8981;&#x5FEB;&#x3002;</p></li><li><p>CGLIB&#x5E95;&#x5C42;&#xFF1A;&#x4F7F;&#x7528;&#x5B57;&#x8282;&#x7801;&#x5904;&#x7406;&#x6846;&#x67B6;ASM&#xFF0C;&#x6765;&#x8F6C;&#x6362;&#x5B57;&#x8282;&#x7801;&#x5E76;&#x751F;&#x6210;&#x65B0;&#x7684;&#x7C7B;&#x3002;&#x4E0D;&#x9F13;&#x52B1;&#x76F4;&#x63A5;&#x4F7F;&#x7528;ASM&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8981;&#x6C42;&#x4F60;&#x5FC5;&#x987B;&#x5BF9;JVM&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x5305;&#x62EC;class&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x548C;&#x6307;&#x4EE4;&#x96C6;&#x90FD;&#x5F88;&#x719F;&#x6089;&#x3002;</p></li><li><p>CGLIB&#x4F18;&#x70B9;&#xFF1A;&#x5B83;&#x4E3A;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#x7684;&#x7C7B;&#x63D0;&#x4F9B;&#x4EE3;&#x7406;&#xFF0C;&#x4E3A;JDK&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x8865;&#x5145;&#x3002;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Java&#x7684;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x521B;&#x5EFA;&#x4EE3;&#x7406;&#xFF0C;&#x4F46;&#x5F53;&#x8981;&#x4EE3;&#x7406;&#x7684;&#x7C7B;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;&#x6216;&#x8005;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;CGLIB&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p></li><li><p>CGLIB&#x7F3A;&#x70B9;&#xFF1A;&#x5BF9;&#x4E8E;final&#x65B9;&#x6CD5;&#xFF0C;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x4EE3;&#x7406;</p></li></ol><h2 id="&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6848;&#x6709;&#x4E0B;&#x5217;&#x51E0;&#x79CD;">&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6848;&#x6709;&#x4E0B;&#x5217;&#x51E0;&#x79CD;</h2><ul><li>jdk &#x52A8;&#x6001;&#x4EE3;&#x7406;</li><li>cglib &#x52A8;&#x6001;&#x4EE3;&#x7406;</li><li>javassist &#x52A8;&#x6001;&#x4EE3;&#x7406;</li><li>ASM &#x5B57;&#x8282;&#x7801;</li><li>javassist &#x5B57;&#x8282;&#x7801;</li></ul></section></div><div class="search-results"><div class="has-results"><h1 class="search-results-title"><span class="search-results-count"></span> results matching "<span class="search-query"></span>"</h1><ul class="search-results-list"></ul></div><div class="no-results"><h1 class="search-results-title">No results matching "<span class="search-query"></span>"</h1></div></div></div></div></div></div></div><script>var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Design Patterns","level":"1.2.3.1","depth":3,"next":{"title":"Framework","level":"1.2.4","depth":2,"ref":"","articles":[{"title":"Dubbo","level":"1.2.4.1","depth":3,"path":"notes/framework/Dubbo.md","ref":"notes/framework/Dubbo.md","articles":[]},{"title":"Kafka","level":"1.2.4.2","depth":3,"path":"notes/framework/Kafka.md","ref":"notes/framework/Kafka.md","articles":[]},{"title":"My Batis","level":"1.2.4.3","depth":3,"path":"notes/framework/MyBatis.md","ref":"notes/framework/MyBatis.md","articles":[]},{"title":"Netty","level":"1.2.4.4","depth":3,"path":"notes/framework/netty.md","ref":"notes/framework/netty.md","articles":[]},{"title":"Nginx","level":"1.2.4.5","depth":3,"path":"notes/framework/Nginx.md","ref":"notes/framework/Nginx.md","articles":[]},{"title":"Solr","level":"1.2.4.6","depth":3,"path":"notes/framework/Solr.md","ref":"notes/framework/Solr.md","articles":[]},{"title":"Spring","level":"1.2.4.7","depth":3,"path":"notes/framework/Spring.md","ref":"notes/framework/Spring.md","articles":[]},{"title":"Tomcat","level":"1.2.4.8","depth":3,"path":"notes/framework/Tomcat.md","ref":"notes/framework/Tomcat.md","articles":[]},{"title":"Zookeeper","level":"1.2.4.9","depth":3,"path":"notes/framework/Zookeeper.md","ref":"notes/framework/Zookeeper.md","articles":[]}]},"previous":{"title":"Design","level":"1.2.3","depth":2,"ref":"","articles":[{"title":"Design Patterns","level":"1.2.3.1","depth":3,"path":"notes/design/Design-Patterns.md","ref":"notes/design/Design-Patterns.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["minifier","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"minifier":{},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Jayclang","pdf":{"pageBreaksBefore":"/","headerTemplate":null,"paperSize":"a4","margin":{"right":62,"left":62,"top":36,"bottom":36},"fontSize":12,"fontFamily":"Arial","footerTemplate":null,"chapterMark":"pagebreak","pageNumbers":false},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"Java Summarize","links":{"sharing":{"all":null,"facebook":null,"google":null,"twitter":null,"weibo":null},"sidebar":{"liangwj's Blog":"http://www.metoocat.cn"}},"gitbook":"*","description":"This is a sample book created by gitbook","extension":null},"file":{"path":"notes/design/Design-Patterns.md","mtime":"2024-07-09T01:12:13.748Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-07-09T01:23:45.001Z"},"basePath":"../..","book":{"language":""}});
        });</script></div><script src="../../gitbook/gitbook.js"></script><script src="../../gitbook/theme.js"></script><script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script><script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script><script src="../../gitbook/gitbook-plugin-search/search.js"></script><script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script><script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script><script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script><script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script></body></html>